loadtests/tests.yaml
config:
  target: http://10.1.135.141:8080
  phases:
    - name: "Warm up service"
      duration: 90
      arrivalRate: 0.5  # Reduced arrival rate for 0.5 requests/second
      rampTo: 10
    - name: "Ramp up high load"
      duration: 210
      arrivalRate: 1  # Reduced arrival rate for 1 request/second
      rampTo: 20
    - name: "Sustained high load"
      duration: 300
      arrivalRate: 2  # Reduced arrival rate for 2 requests/second
      rampTo: 30
  ensure:
    maxErrorRate: 1

scenarios:
  - name: "Create new recipe & get recipes"
    flow:
      - get:
          url: "/recipe/view"
      - get:
          url: "/recipe/view/4"