loadtests/tests.yaml
config:
  target: http://10.1.135.147:8080
  phases:
    - name: "Warm up service"
      duration: 90
      arrivalRate: 0.5  # Reduced arrival rate for 0.5 requests/second
      rampTo: 10
    - name: "Ramp up high load"
      duration: 210
      arrivalRate: 1  # Reduced arrival rate for 1 request/second
      rampTo: 20
    - name: "Sustained high load"
      duration: 300
      arrivalRate: 2  # Reduced arrival rate for 2 requests/second
      rampTo: 30
  ensure:
    maxErrorRate: 1
  payload:
    path: 'mock_data.csv'
    fields:
      - 'userId'
      - 'title'
      - 'description'
      - 'time'
      - 'ingredients'
      - 'steps'
    skipHeader: true


# before:
#   flow:
#     - log: 'Get auth token'
#     - post:
#         url: "/auth/foody/login"
#         json:
#           email: "test@gmail.com"
#           password: "5422"
#         capture:
#           json: "$.token"
#           as: "token"

scenarios:
  - name: "Create new recipe & get recipes"
    flow:
      # - post:
      #     url: "/recipe/1/operations/create"
      #     formData:
      #       title: "{{ title }}"
      #       description: "{{ description }}"
      #       time: "{{ time }}"
      #       steps: "{{ steps }}"
      #       ingredients: "{{ ingredients }}"
      #     headers:
      #       authorization: 'Bearer {{ token }}'
      - get:
          url: "/recipe/view"